[Dungeon.A_TamedWyvern_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Sylvan.A_MotherTreant_Support_Buff_1_Novice H7BaseBuff]
mName="苏生大法"
mTooltip="该生物在其回合开始时回复 %d1.min 生命值。\n持续 %durnow 回合。"

[Sylvan.A_MotherTreant_Support H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="目标本方生物在其回合开始时回复 %buff3.buff.d1.min 生命值，持续 %buff3.buff.durini 回合。"
mName="苏生大法"
mTooltip="目标本方生物在其回合开始时回复 %buff1.buff.d1.min 生命值，持续 %buff1.buff.durini 回合。"

[Sylvan.A_MotherTreant_Support_Buff_2_Expert H7BaseBuff]
mName="苏生大法"
mTooltip="该生物在其回合开始时回复 %d1.min 生命值。\n持续 %durnow 回合。"

[A_Default_Skip H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="结束回合"
mTooltip="结束战争单位回合。"

[Stronghold.A_TamedCyclops_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[A_Default_Wait H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="等待"
mTooltip="该战争单位将在稍晚时候行动，对于等待生物的命令都是反向的。"

[Stronghold.A_Dreamcatcher_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大地箭矢"
mTooltip="对目标生物射击，造成 %d.min 至 %d.max %ICON_EARTH 土系伤害。"

[Stronghold.A_Dreamcatcher_Support H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="为本方生物治疗 %d2.max 生命值。\n（亡灵体和构造体不受影响）"
mName="萨满治疗"
mTooltip="为本方生物治疗 %d1.max 生命值。\n（亡灵体和构造体不受影响）"

[haven.A_CatapultHaven_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Academy.A_TowerAcademy_Attack H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="塔楼攻击"
mTooltip="对敌方生物射击，造成 %d.min 至 %d.max 伤害。"

[Dungeon.A_Faceless_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[haven.A_CatapultHaven_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="投掷碎石"
mTooltip="对要塞造攻击，成 %d.min 至 %d.max% 伤害。"

[Sylvan.A_GreaterEarthElemental_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="投石攻击"
mTooltip="对要塞造攻击，成 %d.min 至 %d.max% 伤害。"

[Necropolis.A_Namtaru_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗影箭矢"
mTooltip="对目标敌方生物射击，造成 %d.min 至 %d.max%ICON_DARK 暗系伤害。"

[Stronghold.A_TowerStronghold_Attack H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="塔楼攻击"
mTooltip="对敌方生物射击，造成 %d.min 至 %d.max 伤害。"

[Sylvan.A_BallistaSylvan_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Sylvan.A_BallistaSylvan_FastReload_Buff H7BaseBuff]
mName="快速装填"
mTooltip=""

[Necropolis.A_SpittingSpider_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="喷吐攻击"
mTooltip="对要塞射击，造成 %d.min 至 %d.max %ICON_DARK 暗系伤害。"

[Dungeon.A_TamedWyvern_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="酸液喷涂"
mTooltip="对要塞造成 %d.min 至 %d.max %ICON_EARTH 土系伤害。"

[haven.A_BallistaHaven_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Sylvan.A_MotherTreant_Support_Buff_4_Ultimate H7BaseBuff]
mName="苏生大法"
mTooltip="该生物在其回合开始时回复 %d1.min 生命值。\n持续 %durnow 回合。"

[Academy.A_GreatPyramid_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大型源力弹"
mTooltip="对要塞造成 %d.min 至 %d.max %ICON_PRIME 源力伤害。"

[Sylvan.A_MotherTreant_Support_Buff_3_Master H7BaseBuff]
mName="苏生大法"
mTooltip="该生物在其回合开始时回复 %d1.min 生命值。\n持续 %durnow 回合。"

[Academy.A_HealingTent_Support H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="治疗目标本方生物或构造体生物 %d3.min 生命值（对构造体和亡灵体无效）。"
mName="疗伤大法"
mTooltip="治疗目标本方生物或构造体生物 %d1.min 生命值（对构造体和亡灵体无效）。"

[Academy.A_SmallPyramid_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="源力弹"
mTooltip="射向敌方生物，造成 %d.min 至 %d.max %ICON_PRIME 源力伤害。"

[Sylvan.A_GreaterEarthElemental_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[haven.A_BallistaHaven_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="发射飞弹"
mTooltip="对目标生物射击，造成 %d.min 至 %d.max 伤害。"

[Sylvan.A_MotherTreant_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Academy.A_SmallPyramid_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Stronghold.A_TamedCyclops_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="巨石投掷"
mTooltip="对要塞造攻击，成 %d.min 至 %d.max% 伤害。"

[neutral.A_Harpoon_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="穿刺射击"
mTooltip="攻击一条直线上的所有目标。"

[Sylvan.A_TowerSylvan_Attack H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="塔楼攻击"
mTooltip="对敌方生物射击，造成 %d.min 至 %d.max 伤害。"

[Dungeon.A_TowerDungeon_Attack H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="塔楼攻击"
mTooltip="对敌方生物射击，造成 %d.min 至 %d.max 伤害。"

[Necropolis.A_SpittingSpider_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[haven.A_HealingSister_Support H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="治疗并复活目标本方生物 %d2.max 生命值。\n（亡灵体和构造体不受影响）"
mName="疗伤大法"
mTooltip="治疗目标生物 %d1.max 生命值。\n（亡灵体和构造体不受影响）\n\n习得厉兵秣马后解锁复活阵亡生物功效。"

[haven.A_TowerHaven_Attack H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="塔楼攻击"
mTooltip="对敌方生物射击，造成 %d.min 至 %d.max 伤害。"

[Sylvan.A_BallistaSylvan_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="发射飞弹"
mTooltip="对目标生物射击，造成 %d.min 至 %d.max 伤害。"

[Necropolis.A_Namtaru_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Stronghold.A_Dreamcatcher_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Dungeon.A_ShadowLurker_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Academy.A_GreatPyramid_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Academy.A_HealingTent_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Necropolis.A_TowerNecropolis_Attack H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="塔楼攻击"
mTooltip="对敌方生物射击，造成 %d.min 至 %d.max 伤害。"

[Sylvan.A_MotherTreant_Support_Buff_0_Unskilled H7BaseBuff]
mName="苏生大法"
mTooltip="该生物在其回合开始时回复 %d1.min 生命值。\n持续 %durnow 回合。"

[haven.A_HealingSister_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Necropolis.A_NamtaruCaller_AttackAbility H7WarfareAbility]
mName="暗影箭矢"
mTooltip="射向敌方生物，造成 %d.min 至 %d.max %d1.icon 暗系伤害。"

[Dungeon.A_Faceless_Support H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="将本方生物裹入死神斗篷。当该生物被近战攻击时，死神斗篷对攻击者造成 %buff2.buff.d1.min %ICON_DARK 暗系伤害。\n当死神斗篷失效时，它将对邻近敌人造成 %buff2.buff.d2.min %ICON_DARK 暗系伤害。"
mName="死神斗篷"
mTooltip="将本方生物裹入死神斗篷。当该生物被近战攻击时，死神斗篷对攻击者造成 %buff1.buff.d.min %ICON_DARK 暗系伤害。\n\n习得厉兵秣马后解锁：死神斗篷在效果结束时产生爆炸效果。"

UCP 1.1

[Dungeon.A_Faceless_Buff_0_Unskilled H7BaseBuff]
mName="死神斗篷"
mTooltip="对下个敌方进行近战的生物造成 %d.min %ICON_DARK 暗系伤害。\n持续到下个战斗回合结束或该生物被攻击。"

[Dungeon.A_Faceless_Buff_1_Novice H7BaseBuff]
mName="死神斗篷"
mTooltip="对下个敌方进行近战的生物造成 %d.min %ICON_DARK 暗系伤害。\n持续到下个战斗回合结束或该生物被攻击。"

[Dungeon.A_Faceless_Buff_2_Expert H7BaseBuff]
mName="死神斗篷"
mTooltip="对下个敌方进行近战的生物造成 %d.min %ICON_DARK 暗系伤害。\n持续到下个战斗回合结束或该生物被攻击。"

[Dungeon.A_Faceless_Buff_3_Master H7BaseBuff]
mName="死神斗篷"
mTooltip="对下个敌方进行近战的生物造成 %d.min %ICON_DARK 暗系伤害。\n持续到下个战斗回合结束或该生物被攻击。"

[Dungeon.A_Faceless_Buff_4_Ultimate H7BaseBuff]
mName="死神斗篷"
mTooltip="对下个敌方进行近战的生物造成 %d1.min %ICON_DARK 暗系伤害。\n持续到下个战斗回合结束或该生物被攻击。\n\n当死神斗篷失效时，它将对相邻敌人造成 %d2.min %ICON_DARK 暗系伤害。"

[Dungeon.A_ShadowLurker_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="折磨幻想"
mTooltip="射向敌方生物，造成 %d.min 至 %d.max %ICON_DARK 暗系伤害，目标生物继续遭受 %buff.buff.special 伤害值，持续 %buff.buff.durini 回合。"

[Dungeon.A_ShadowLurker_Attack_Buff H7BaseBuff]
mName="折磨幻想"
mTooltip="该生物在每回合开始时受到 %special1.val1 %ICON_DARK 暗系伤害。\n持续 %durnow 回合。"

[Necropolis.A_Namtaru_Support H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltip="驱散本方生物所有负面光系效果。每个生物组队的攻击将额外造成 %buff1.buff.d.min %buff1.buff.d.icon 暗系伤害，持续 %buff1.buff.durini 回合。"
mTooltipUpgraded="驱散本方生物所有负面光系效果。每个生物组队的攻击将额外造成 %buff2.buff.d.min %buff2.buff.d.icon 暗系伤害，持续 %buff2.buff.durini 回合。"
mName="黑暗之触"

[Necropolis.A_NamtaruCaller_SupportAbility H7WarfareAbility]
mName="黑暗之触"
mTooltip="驱散本方生物所有负面光系效果。每个生物组队的攻击将额外造成 %buff.buff.d.min %buff.buff.d.icon 暗系伤害，持续 %buff.buff.durini 回合。"

[Necropolis.A_Namtaru_Support_Buff_0_Unskilled H7BaseBuff]
mName="黑暗之触"
mTooltip="生物每次攻击均额外造成 %d.min %ICON_DARK 暗系伤害。"

[Necropolis.A_Namtaru_Support_Buff_1_Novice H7BaseBuff]
mName="黑暗之触"
mTooltip="生物每次攻击均额外造成 %d.min %ICON_DARK 暗系伤害。"

[Necropolis.A_Namtaru_Support_Buff_2_Expert H7BaseBuff]
mName="黑暗之触"
mTooltip="生物每次攻击均额外造成 %d.min %ICON_DARK 暗系伤害。"

[Necropolis.A_Namtaru_Support_Buff_3_Master H7BaseBuff]
mName="黑暗之触"
mTooltip="生物每次攻击均额外造成 %d.min %ICON_DARK 暗系伤害。"

[Necropolis.A_Namtaru_Support_Buff_4_Ultimate H7BaseBuff]
mName="黑暗之触"
mTooltip="生物每次攻击均额外造成 %d.min %ICON_DARK 暗系伤害。"


[Stronghold.A_Dreamcatcher_Support_Spec H7WarfareAbility]
mName="萨满治疗"
mTooltip="为本方生物治疗 %d1.max 生命值。\n（亡灵体和构造体不受影响）"
mTooltipUpgraded="为本方生物治疗 %d2.max 生命值。\n（亡灵体和构造体不受影响）"